In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("emp.csv")

In [3]:
df.head()

   ID  Age  Experience_Years  Salary  Gender
0   1   25                 5   20000  Female
1   2   30                 6   30000   Male
2   3   35                 7   40000  Female
3   4   40                 8   50000  Female
4   5   42                 9   60000   Male

In [4]:
df.mean()

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\972437606.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

ID                      5.5
Age                    39.9
Experience_Years        6.5
Salary              49200.0
dtype: float64

In [6]:
df.loc[:,'Age'].mean()

39.9

In [7]:
df.mean(axis=1)[0:4]

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\850889490.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=1)[0:4]

0     5007.75
1     7509.50
2    10011.25
3    12513.00
dtype: float64

In [8]:
df.median()

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\222071786.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

ID                      5.5
Age                    41.0
Experience_Years        6.5
Salary              45000.0
dtype: float64

In [10]:
df.loc[:,'Salary'].median()

45000.0

In [11]:
df.median(axis=1)[0:4]

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\1236697501.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median(axis=1)[0:4]

0    15.0
1    18.0
2    21.0
3    24.0
dtype: float64

In [12]:
df.mode()

   ID  Age  Experience_Years  Salary  Gender
0   1   25               5.0   20000  Female
1   2   30               6.0   21000     NaN
2   3   32               7.0   30000     NaN
3   4   35               8.0   31000     NaN
4   5   40               NaN   40000     NaN
5   6   42               NaN   50000     NaN
6   7   43               NaN   60000     NaN
7   8   49               NaN   70000     NaN
8   9   51               NaN   80000     NaN
9  10   52               NaN   90000     NaN

In [13]:
df.loc[:,'Age'].mode()

0    25
1    30
2    32
3    35
4    40
5    42
6    43
7    49
8    51
9    52
Name: Age, dtype: int64

In [14]:
df.min()

ID                       1
Age                     25
Experience_Years         4
Salary               20000
Gender              Female
dtype: object

In [15]:
df.loc[:,'Age'].min(skipna = False)

25

In [16]:
df.max()

ID                     10
Age                    52
Experience_Years        9
Salary              90000
Gender              Male
dtype: object

In [17]:
df.loc[:,'Salary'].min(skipna = False)

20000

In [18]:
df.std()

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\3971434360.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std()

ID                      3.027650
Age                     9.267026
Experience_Years        1.581139
Salary              24934.581074
dtype: float64

In [19]:
df.loc[:,'Age'].std()

9.267026371915524

In [20]:
df.std(axis=1)[0:4]

C:\Users\LEGION\AppData\Local\Temp\ipykernel_10424\2185080913.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.std(axis=1)[0:4]

0     9994.838847
1    14993.671765
2    19992.505069
3    24991.338526
dtype: float64

In [23]:
df.groupby(['Age'])['Salary'].mean()

Age
25    20000.0
30    30000.0
32    70000.0
35    40000.0
40    50000.0
42    60000.0
43    90000.0
49    21000.0
51    31000.0
52    80000.0
Name: Salary, dtype: float64

In [24]:
df_u=df.rename(columns= {'Salary':'income'},inplace=False)
(df_u.groupby(['Age']).income.mean())

Age
25    20000.0
30    30000.0
32    70000.0
35    40000.0
40    50000.0
42    60000.0
43    90000.0
49    21000.0
51    31000.0
52    80000.0
Name: income, dtype: float64

In [26]:
from sklearn import preprocessing
enc = preprocessing.LabelEncoder()
df['Gender'] = enc.fit_transform(df['Gender'])
df1=df
df

   ID  Age  Experience_Years  Salary  Gender
0   1   25                 5       0       0
1   2   30                 6       2       1
2   3   35                 7       4       0
3   4   40                 8       5       0
4   5   42                 9       6       1
5   6   32                 8       7       0
6   7   52                 7       8       0
7   8   43                 6       9       1
8   9   49                 5       1       1
9  10   51                 4       3       0

In [27]:
from sklearn import preprocessing
enc = preprocessing.OneHotEncoder()
enc_df = pd.DataFrame(enc.fit_transform(df[['Salary']]).toarray())
df_encode =df_u.join(enc_df)
df_encode

,ID,Age,Experience_Years,income,Gender,0,1,2,3,4,5,6,7,8,9
0,1,25,5,20000,Female,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,30,6,30000,Male,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,35,7,40000,Female,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
3,4,40,8,50000,Female,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
4,5,42,9,60000,Male,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
5,6,32,8,70000,Female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
6,7,52,7,80000,Female,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
7,8,43,6,90000,Male,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
8,9,49,5,21000,Male,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
9,10,51,4,31000,Female,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0

In [28]:
iris = pd.read_csv("iris.csv")
iris.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [34]:
irisSet = (iris['Species']== 'Iris-setosa')
print('Iris-setosa')
print(iris[irisSet].describe())

Iris-setosa
             Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  50.00000       50.00000     50.000000      50.000000      50.00000
mean   25.50000        5.00600      3.418000       1.464000       0.24400
std    14.57738        0.35249      0.381024       0.173511       0.10721
min     1.00000        4.30000      2.300000       1.000000       0.10000
25%    13.25000        4.80000      3.125000       1.400000       0.20000
50%    25.50000        5.00000      3.400000       1.500000       0.20000
75%    37.75000        5.20000      3.675000       1.575000       0.30000
max    50.00000        5.80000      4.400000       1.900000       0.60000

In [35]:
irisVer = (iris['Species']== 'Iris-versicolor')
print('Iris-versicolor')
print(iris[irisVer].describe())

Iris-versicolor
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000      50.000000     50.000000      50.000000     50.000000
mean    75.50000       5.936000      2.770000       4.260000      1.326000
std     14.57738       0.516171      0.313798       0.469911      0.197753
min     51.00000       4.900000      2.000000       3.000000      1.000000
25%     63.25000       5.600000      2.525000       4.000000      1.200000
50%     75.50000       5.900000      2.800000       4.350000      1.300000
75%     87.75000       6.300000      3.000000       4.600000      1.500000
max    100.00000       7.000000      3.400000       5.100000      1.800000

In [36]:
irisVir = (iris['Species']== 'Iris-virginica')
print('Iris-virginica')
print(iris[irisVir].describe())

Iris-virginica
              Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count   50.00000       50.00000     50.000000      50.000000      50.00000
mean   125.50000        6.58800      2.974000       5.552000       2.02600
std     14.57738        0.63588      0.322497       0.551895       0.27465
min    101.00000        4.90000      2.200000       4.500000       1.40000
25%    113.25000        6.22500      2.800000       5.100000       1.80000
50%    125.50000        6.50000      3.000000       5.550000       2.00000
75%    137.75000        6.90000      3.175000       5.875000       2.30000
max    150.00000        7.90000      3.800000       6.900000       2.50000